@rem Имя локального пользователя, под которым будетм работать
set user_name=test_user
@rem Имя запланированного задание, под которым будет работать приложение
set task_name=Test_task_bat

@rem ***********************************************************************************************
@rem В зависимости от языка ОС определяем имена системных параметров
@rem ***********************************************************************************************
@rem S-1-5-32-545 - локальные пользователи
@rem S-1-5-32-544 - администраторы
Set GroupSID=S-1-5-32-545
Set GroupName=
For /F "UseBackQ Tokens=1* Delims==" %%I In (`WMIC Group Where "SID = '%GroupSID%'" Get Name /Value ^| Find "="`) Do Set GroupName=%%J
Set GroupName=%GroupName:~0,-1%
@rem ***********************************************************************************************

@REM Удаление локального пользователя из локальной группы
net localgroup %GroupName% %user_name% /DELETE

@REM Удаление пользователя
net user %user_name% /DELETE

@REM Форсированное удаление (без необходимости подтверждения) запланированного задания
schtasks /delete /tn "%task_name%" /F